###############################################################################
# Created by write_sdc
# Mon Nov 22 18:56:50 2021
###############################################################################
current_design memGenTopLevel
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clock -period 4.0000 [get_ports {clock}]
set_clock_uncertainty 0.0000 clock
set_propagated_clock [get_clocks {clock}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
