###############################################################################
# Created by write_sdc
# Mon Nov 22 18:57:32 2021
###############################################################################
current_design memGenTopLevel
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clock -period 2.3253 [get_ports {clock}]
set_clock_uncertainty 0.0000 clock
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
